
* Информация о каталогах сайта vsegost.com
Информация о ГОСТ, размещенная на сайте vsegost.com, содержится в
нескольких каталогах:
#+begin_src shell
  find ~/public_html/vsegost.com -maxdepth 1 -type d
#+end_src

#+RESULTS:
| /home/mna/public_html/vsegost.com             |
| /home/mna/public_html/vsegost.com/js          |
| /home/mna/public_html/vsegost.com/Data        |
| /home/mna/public_html/vsegost.com/Catalog     |
| /home/mna/public_html/vsegost.com/icons       |
| /home/mna/public_html/vsegost.com/Categories  |
| /home/mna/public_html/vsegost.com/DataTN      |
| /home/mna/public_html/vsegost.com/css         |
| /home/mna/public_html/vsegost.com/NCategories |

** Для создания файла импорта в PostgreSQL выполнте следующее:
   
#+begin_src lisp
  (in-package :vse-gost)

  (defparameter *files*
    (directory
     "/home/mna/public_html/vsegost.com/Catalog/*/*.shtml.html")
    "Список файлов, в которых присутствует информация о ГОСТ."
    )

  (defparameter *out-file*
     (concatenate 'string
                (uiop:getenv "HOME")
                "/"
                "out.txt"))

  (create-sql-import-file *out-file* (namestring *vsegost-Catalog*))

  (list (list "out-file" *out-file*)
        (list "vsegost-Catalog" (namestring *vsegost-Catalog*))
        (list "vsegost-Data" (namestring *vsegost-Data*))
        (list "GOST number" (length *files*)))
#+end_src

#+RESULTS:
| out-file        | /home/mna/out.txt                          |
| vsegost-Catalog | /home/mna/public_html/vsegost.com/Catalog/ |
| vsegost-Data    | /home/mna/public_html/vsegost.com/Data/    |
| GOST number     | 48371                                      |

